Revit 2024 API
RebarBendData.HookAngle0 Property
 The angle of the hook at the start.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public int HookAngle0 { get; set; }
Visual Basic
Public Property HookAngle0 As Integer
	Get
	Set
Visual C++
public:
property int HookAngle0 {
	int get ();
	void set (int value);
}
See Also
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace